# pandasでデータの読み込み・書き込み
pandasでのデータの取扱から、データの読み込み、書き込みを行います。

## 内容

- シリーズとは
- データフレームとは
- 概要を見る
- インデックス名、カラム名
- データのピックアップ
- データの読み込み (CSV / Excel / HTML / SQL)
- データの書き込み (CSV / Excel)
- データの再利用 (pickle)

In [1]:
import pandas as pd

pandasライブラリのインポート。
as pdとし、pdで呼び出せるようにしています。

In [2]:
import numpy as np

後で、NumPyライブラリを使って、データク作成などを行うのでインポートしておく。

## シリーズとは

In [3]:
ser = pd.Series([10, 20, 30, 40])

In [4]:
ser

0    10
1    20
2    30
3    40
dtype: int64

4要素のシリーズオブジェクトを作って、内容を表示。

シリーズオブジェクトは、1次元のデータ

## データフレームとは

In [5]:
df = pd.DataFrame([[10, "a", True], [20, "b", False,], [30, "c", False], [40, "d", True]])

In [6]:
df

    0  1      2
0  10  a   True
1  20  b  False
2  30  c  False
3  40  d   True

4行3列のデータフレームを作って、内容を表示。

データフレームは、2次元データ

## 概要を見る

In [7]:
df = pd.DataFrame(np.arange(100).reshape(25, 4))

NumPyのarangeを使って25行4列のデータを生成し、データフレームを作った

In [8]:
df

     0   1   2   3
0    0   1   2   3
1    4   5   6   7
2    8   9  10  11
3   12  13  14  15
4   16  17  18  19
5   20  21  22  23
6   24  25  26  27
7   28  29  30  31
8   32  33  34  35
9   36  37  38  39
10  40  41  42  43
11  44  45  46  47
12  48  49  50  51
13  52  53  54  55
14  56  57  58  59
15  60  61  62  63
16  64  65  66  67
17  68  69  70  71
18  72  73  74  75
19  76  77  78  79
20  80  81  82  83
21  84  85  86  87
22  88  89  90  91
23  92  93  94  95
24  96  97  98  99

In [9]:
df.head()

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [10]:
df.tail()

     0   1   2   3
20  80  81  82  83
21  84  85  86  87
22  88  89  90  91
23  92  93  94  95
24  96  97  98  99

In [11]:
df.shape

(25, 4)

## インデックス名、カラム名

pandasでは、わかりやすいインデックス名(行に名前付け)やカラム名(列に名前付け)ができます。

In [12]:
df = pd.DataFrame(np.arange(6).reshape([3, 2]))

In [13]:
df

   0  1
0  0  1
1  2  3
2  4  5

In [14]:
df.columns = ["A", "B"]

In [15]:
df.index = ["01", "02", "03"]

In [16]:
df

    A  B
01  0  1
02  2  3
03  4  5

In [17]:
named_df = pd.DataFrame(np.arange(6).reshape([3, 2]), columns=["A列", "B列"], index=["1行目", "2行目", "3行目"])

In [18]:
named_df

     A列  B列
1行目   0   1
2行目   2   3
3行目   4   5

## データのピックアップ

In [19]:
df["A"]

01    0
02    2
03    4
Name: A, dtype: int64

In [20]:
df[["A", "B"]]

    A  B
01  0  1
02  2  3
03  4  5

In [21]:
df[:2]

    A  B
01  0  1
02  2  3

In [22]:
df.loc[:, :]

    A  B
01  0  1
02  2  3
03  4  5

In [23]:
df.loc[:, "A"]

01    0
02    2
03    4
Name: A, dtype: int64

In [24]:
df.loc[:, ["A", "B"]]

    A  B
01  0  1
02  2  3
03  4  5

In [25]:
df.loc["01", :]

A    0
B    1
Name: 01, dtype: int64

In [26]:
df.loc[["01", "03"], :]

    A  B
01  0  1
03  4  5

In [27]:
df.iloc[1, 1]

3

In [28]:
df.iloc[1:, 1]

02    3
03    5
Name: B, dtype: int64

In [29]:
df.iloc[1:, :2]

    A  B
02  2  3
03  4  5

## データの読み込み (CSV / Excel / HTML / SQL)

In [30]:
df = pd.read_csv("data/201704health.csv", encoding="utf-8")

In [31]:
df

            日付     歩数  摂取カロリー
0   2017-04-01   5439    2500
1   2017-04-02   2510    2300
2   2017-04-03  10238    1950
3   2017-04-04   8209    1850
4   2017-04-05   9434    1930
5   2017-04-06   7593    1800
6   2017-04-07   9320    1940
7   2017-04-08   4873    2300
8   2017-04-09  12045    1950
9   2017-04-10   7493    1850
10  2017-04-11   7289    1930
11  2017-04-12   6481    2300
12  2017-04-13  10287    1800
13  2017-04-14   8043    1940
14  2017-04-15   7435    2300
15  2017-04-16   7529    2300
16  2017-04-17   8031    1940
17  2017-04-18   8475    2300
18  2017-04-19   8132    1950
19  2017-04-20  15328    1800
20  2017-04-21  12849    1940
21  2017-04-22   4029    2300
22  2017-04-23   3890    1950
23  2017-04-24   8093    1850
24  2017-04-25   7823    1950
25  2017-04-26   7492    1850
26  2017-04-27   7203    1930
27  2017-04-28   7302    1850
28  2017-04-29   6033    2300
29  2017-04-30   4093    1950

### Excleデータの読み込み

xlrd ライブラリが必要

```
pip install xlrd
```

In [32]:
df = pd.read_excel("data/201704health.xlsx")

In [33]:
df

            日付     歩数  摂取カロリー
0   2017-04-01   5439    2500
1   2017-04-02   2510    2300
2   2017-04-03  10238    1950
3   2017-04-04   8209    1850
4   2017-04-05   9434    1930
5   2017-04-06   7593    1800
6   2017-04-07   9320    1940
7   2017-04-08   4873    2300
8   2017-04-09  12045    1950
9   2017-04-10   7493    1850
10  2017-04-11   7289    1930
11  2017-04-12   6481    2300
12  2017-04-13  10287    1800
13  2017-04-14   8043    1940
14  2017-04-15   7435    2300
15  2017-04-16   7529    2300
16  2017-04-17   8031    1940
17  2017-04-18   8475    2300
18  2017-04-19   8132    1950
19  2017-04-20  15328    1800
20  2017-04-21  12849    1940
21  2017-04-22   4029    2300
22  2017-04-23   3890    1950
23  2017-04-24   8093    1850
24  2017-04-25   7823    1950
25  2017-04-26   7492    1850
26  2017-04-27   7203    1930
27  2017-04-28   7302    1850
28  2017-04-29   6033    2300
29  2017-04-30   4093    1950

### HTML読み込み
PyCampの開催場所データを読み込む
https://www.pycon.jp/support/bootcamp.html

lxml と BeautifulSoup4ライブラリのインストールが必要

```
pip install lxml
pip install BeautifulSoup4
```

macOSの場合
OS側の変更で、OpenSSLを使用しないようになったようで、SSL errorが出る場合があるようです。
Applications/Python 3.6 フォルダにある、`Install Certificates.command` をダブルクリックする必要があるようです。

In [34]:
tables = pd.read_html("https://www.pycon.jp/support/bootcamp.html")

In [35]:
len(tables)

1

In [36]:
df = tables[0]

In [37]:
df

,No.,イベント,開催日,会場,講師,参加者,TA,Staff,開催レポート
0,NaN,2016年,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.0,Python Boot Camp in 京都,6月18日(土),CAMPHOR- HOUSE,谷口 英,5名,2.0,1.0,開催レポート
2,2.0,Python Boot Camp in 愛媛,7月30日(土),サイボウズ松山オフィス,寺田 学,12名,2.0,1.0,開催レポート
3,3.0,Python Boot Camp in 熊本,8月28日(日),未来会議室,寺田 学,8名,2.0,1.0,開催レポート
4,4.0,Python Boot Camp in 札幌,11月19日(土),株式会社インフィニットループ,村岡 友介,17名,2.0,1.0,開催レポート
5,NaN,2017年,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,5.0,Python Boot Camp in 栃木小山,2月11日(土),小山市立生涯学習センター,寺田 学,10名,2.0,1.0,開催レポート
7,6.0,Python Boot Camp in 広島,3月11日(土),中四国マネジメントシステム推進機構,鈴木 たかのり,15名,3.0,1.0,開催レポート
8,7.0,Python Boot Camp in 大阪,4月8日(土),株式会社ソウ,寺田 学,15名,3.0,4.0,開催レポート
9,8.0,Python Boot Camp in 神戸,5月20日(土),株式会社神戸デジタル・ラボ,清水川 貴之,21名,3.0,1.0,開催レポート
10,9.0,Python Boot Camp in 長野,6月10日(土),GEEKLAB.NAGANO,寺田 学,27名,3.0,2.0,開催レポート
11,10.0,Python Boot Camp in 香川,6月24日(土),e-とぴあ・かがわ,鈴木 たかのり,20名,3.0,1.0,開催レポート
12,11.0,Python Boot Camp in 愛知,7月29日(土),MYCAFE CLASSIC,鈴木 たかのり,37名,7.0,1.0,開催レポート
13,12.0,Python Boot Camp in 福岡,9月30日(土),ヌーラボ 福岡本社,清水川 貴之,32名,5.0,3.0,開催レポート
14,13.0,Python Boot Camp in 長野八ヶ岳,10月28日(土),富士見森のオフィス,鈴木 たかのり,15名,2.0,1.0,開催レポート
15,14.0,Python Boot Camp in 鹿児島,11月4日(土),リコーITソリューションズ,清水川 貴之,27名,3.0,5.0,開催レポート
16,15.0,Python Boot Camp in 静岡,11月18日(土),遠鉄モール街ビル Any,清水川 貴之,10名,2.0,1.0,開催レポート
17,16.0,Python Boot Camp in 新潟南魚沼,12月9日(土),国際大学,鈴木 たかのり,21名,2.0,2.0,開催レポート
18,17.0,Python Boot Camp in 埼玉,12月16日(土),貸し会議室6F（ロクエフ）,寺田 学,35名,10.0,3.0,NaN
19,NaN,2018年,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20,18.0,Python Boot Camp in 神奈川,1月27日(土),FG-Space,鈴木 たかのり,15名(予定),NaN,NaN,NaN
21,19.0,Python Boot Camp in 金沢,2月24日(土),ITビジネスプラザ武蔵,鈴木 たかのり,20名(予定),NaN,NaN,NaN

### SQL DBからの読み込み
SQLAlchemy が必要。データベースドライバも必要。

```
pip install sqlalchemy
```

In [38]:
from sqlalchemy import create_engine

In [39]:
engine = create_engine('sqlite:///data/sample.sqlite')

In [40]:
df = pd.read_sql_table("names", engine)

In [41]:
df

   id name  age                emal
0   1   寺田   47  terada@example.com
1   2   佐藤   40    sato@example.com
2   3   鈴木   29  suzuki@example.com

## データの書き込み (CSV / Excel)

In [42]:
df

   id name  age                emal
0   1   寺田   47  terada@example.com
1   2   佐藤   40    sato@example.com
2   3   鈴木   29  suzuki@example.com

In [43]:
df.to_csv("data/write_data.csv")

### Excel書き込み

openpyxl ライブラリが必要

```
pip install openpyxl
```

In [44]:
df.to_excel("data/write_data.xlsx")

## データの再利用 (pickle)

データフレームを再利用できるように、Pythonのシリアライズ化の仕組みを使って、ファイルシステムに保存します。

In [45]:
df = pd.DataFrame(np.random.rand(25, 4))

In [46]:
df

           0         1         2         3
0   0.951397  0.091848  0.958263  0.611580
1   0.807125  0.054190  0.005455  0.745059
2   0.453341  0.905533  0.366423  0.287353
3   0.933751  0.447825  0.240584  0.216006
4   0.352036  0.298237  0.907406  0.121985
5   0.100947  0.872201  0.845373  0.158278
6   0.085045  0.602250  0.022267  0.678929
7   0.971193  0.706621  0.743703  0.627288
8   0.047931  0.550876  0.438371  0.050366
9   0.872244  0.304554  0.679666  0.562925
10  0.752739  0.568100  0.465671  0.175362
11  0.507891  0.951628  0.884395  0.384481
12  0.303948  0.332477  0.606400  0.548663
13  0.213485  0.364843  0.152117  0.731323
14  0.492851  0.767307  0.975886  0.403449
15  0.335900  0.885396  0.034514  0.927596
16  0.571089  0.206767  0.068585  0.750980
17  0.920905  0.217327  0.327013  0.626818
18  0.106244  0.923109  0.387433  0.036278
19  0.264440  0.365442  0.235882  0.061449
20  0.945998  0.023934  0.648115  0.162867
21  0.940256  0.630757  0.398477  0.547211
22  0.503320  0.691025  0.666558  0.716984
23  0.639112  0.247832  0.395851  0.725739
24  0.383326  0.286032  0.349754  0.412920

In [47]:
df.to_pickle("data/write_df.pickle")

In [48]:
df = pd.DataFrame([[1, 2, 3, 4], [4, 5, 7, 8]])

In [49]:
df

   0  1  2  3
0  1  2  3  4
1  4  5  7  8

In [50]:
df = pd.read_pickle("data/write_df.pickle")

In [51]:
df.head()

          0         1         2         3
0  0.951397  0.091848  0.958263  0.611580
1  0.807125  0.054190  0.005455  0.745059
2  0.453341  0.905533  0.366423  0.287353
3  0.933751  0.447825  0.240584  0.216006
4  0.352036  0.298237  0.907406  0.121985

In [52]:
df.shape

(25, 4)